# 给出一个 32 位的有符号整数，你需要将这个整数中每位上的数字进行反转。

#  

# 注意：

# 假设我们的环境只能存储得下 32 位的有符号整数，则其数值范围为 [−231,  231 − 1]。请根据这个假设，如果反转后整数溢出那么就返回 0。
#  

# 示例 1：

# 输入：x = 123
# 输出：321
# 示例 2：

# 输入：x = -123
# 输出：-321
# 示例 3：

# 输入：x = 120
# 输出：21
# 示例 4：

# 输入：x = 0
# 输出：0
#  

# 提示：

# -231 <= x <= 231 - 1

class Solution:
    def reverse(self, x: int) -> int:
    	'''
    	做一道简单的放松一下
    	'''

        tag = 0
        if x < 0 :
            x = -x
            tag = 1

        tmp = []
        while x != 0:
            tmp.append(x % 10)
            x = x // 10
        n = len(tmp)
        for i in range(n):
            x = x + tmp[i]* (10 ** (n-i-1))
        if x > 2 ** 31 - 1:
            return 0
        if tag == 1:
            x = -x
        return x